{"id":130,"date":"2020-05-04T10:17:00","date_gmt":"2020-05-04T08:17:00","guid":{"rendered":"https:\/\/triggergrowth.com\/?p=130"},"modified":"2020-06-15T13:04:48","modified_gmt":"2020-06-15T11:04:48","slug":"buy-high-value-domain","status":"publish","type":"post","link":"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/","title":{"rendered":"How to Buy Your Brand Domain Name"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"603\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image-1024x603.jpg\" alt=\"\" class=\"wp-image-191\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image-1024x603.jpg 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image-300x177.jpg 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image-768x452.jpg 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image-20x12.jpg 20w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image.jpg 1318w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>High-value .COM domain names are becoming common acquisitions for existing companies and startups alike. In some cases, organizations are paying seven or even eight-figure fees to purchase a domain. A recent example is that of Voice.com, which was sold by tech giant MicroStrategy for $30 million.<\/p>\n\n\n\n<p>With such vast sums of money being spent on domain names, you would be forgiven for thinking that the whole process of acquiring a premium .COM domain is relatively simple. Unfortunately, there are several potential pitfalls that make buying a high-value domain name problematic. <\/p>\n\n\n\n<p>Thanks to our experience of advising companies about domain name acquisitions, we have encountered many of these potential pitfalls, and have successfully manoeuvred around them. Here, we’re using our experiences as well as expert advice from our professional network to answer some of the most pressing questions about high-value domain acquisitions.<\/p>\n\n\n\n<p>We start with the question of when to use a marketplace. This comes from a scenario in which a client was looking to acquire a four-letter .COM domain name, but it was already listed at popular marketplaces for a purchase price of $25,000. Is it best practice to directly acquire a domain name through a marketplace?<\/p>\n\n\n\n<h2>When to Use a Marketplace<\/h2>\n\n\n\n<p>Much like the real estate market, the domain name aftermarket has numerous destinations to find .COM domain names that have been actively listed for sale. Leading domain provider GoDaddy, for example, operates two aftermarket platforms - GoDaddy Auctions, and Afternic. These marketplaces facilitate hundreds of domain sales per month. <\/p>\n\n\n\n<p>Aside from GoDaddy, companies such as Sedo, DAN, and BrandBucket run marketplaces where predominantly companies can buy domain names that have been directly listed by their owners. Unfortunately, there is no single marketplace for all domain names. There is no Amazon.com for domains. <\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"459\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-1024x459.jpg\" alt=\"\" class=\"wp-image-192\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-1024x459.jpg 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-300x134.jpg 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-768x344.jpg 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-1536x688.jpg 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-20x9.jpg 20w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image-1320x591.jpg 1320w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domains-screenshots-image.jpg 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Each marketplace offers a different experience and a slightly different inventory. So why bother using a marketplace anyway?<\/p>\n\n\n\n<h3>Inventory<\/h3>\n\n\n\n<p>Some domain name marketplaces contain over a million domains, all ready and available to buy at any time of the day or night. This inventory is searchable so that you can either look for a specific domain or find inspiration for a domain purchase that either contains a specific keyword or that can be used within a particular industry.<\/p>\n\n\n\n<h3>Security<\/h3>\n\n\n\n<p>Security is a leading reason for using a marketplace. Before a domain owner can add their domain to most leading domain name marketplaces, they are made to verify their ownership of the domain, meaning that any domain you see on a leading domain marketplace has been listed for sale directly by the owner. <\/p>\n\n\n\n<p>This reduces the risk of buying a stolen domain name. Most marketplaces also have taskforces in place to spot stolen domains that may have made their way onto their platform. <\/p>\n\n\n\n<h3>Support<\/h3>\n\n\n\n<p>Leading marketplaces such as Afternic, Sedo, or DAN close thousands of domain name sales per month. With such a large number of transactions occurring, the marketplaces need to have a top-quality support network in place. <\/p>\n\n\n\n<p>The support teams for leading marketplaces will be able to help you at every stage when attempting to acquire a domain through their marketplace. In fact, in most cases, the support crew will work on your behalf to get the domain name transferred into your possession.<\/p>\n\n\n\n<h2>How to Valuate the Domain Name<\/h2>\n\n\n\n<p>One of the most difficult feats that you could undertake is accurately valuing a domain name. The perceived value of a domain varies depending on who is looking to acquire that name. For example, Ring founder Jamie Siminoff <a rel=\"nofollow noopener noreferrer\" target=\"_blank\" href=\"http:\/\/www.dnjournal.com\/archive\/lowdown\/2018\/dailyposts\/20180307.htm\">paid<\/a> $1 million to acquire the Ring.com domain name because the perceived value of the domain name was higher for Ring since they needed a global Internet presence to sell their Ring doorbells from. <\/p>\n\n\n\n<p>The question of how to value a domain name has long been argued amongst domain investors, brokers, and commentators. There is no way to consistently and accurately appraise domain names. However, we can use some metrics to find a valuation range.<\/p>\n\n\n\n<h3>Domain Sales Data<\/h3>\n\n\n\n<p>The most important consideration for how to value a domain is to look at other domain sales data. Fortunately, the domain industry has a couple of accurate, reputable resources available to help you research historical sales. <\/p>\n\n\n\n<p>DNJournal publishes a weekly list of the largest reported sales from the past seven days. This list is curated and verified by DNJournal’s editor and founder, Ron Jackson, who is one of the most respected commentators in the domain industry. Referencing the <a rel=\"nofollow noopener noreferrer\" target=\"_blank\" href=\"https:\/\/www.dnjournal.com\/domainsales.htm\">weekly list<\/a>, as well as the <a rel=\"nofollow noopener noreferrer\" target=\"_blank\" href=\"https:\/\/www.dnjournal.com\/ytd-sales-charts.htm\">annual sales<\/a> chart, may help you to be informed of current domain prices.<\/p>\n\n\n\n<p>DNJournal is an excellent starting point for valuing one-word or two-word .COM domains in particular, but what if you’re looking to value a domain with a specific keyword, or that contains a specific pattern? Enter NameBio. <\/p>\n\n\n\n<p>NameBio collects data daily from leading domain marketplaces and presents the data in a searchable database. As of writing, that database contains over 777,000 domain sales totalling $1.8 billion in value. <\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1920\" height=\"760\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/top-domains-list-image.svg\" alt=\"\" class=\"wp-image-194\"\/><\/figure>\n\n\n\n<p>This database allows you to search sales back to the late 1990s, and you can narrow down your searches using 12 different criteria. For example, if you are looking for the value of a one-word .COM domain name that is five letters long, and is linked to the Artificial Intelligence industry, you can do that. <\/p>\n\n\n\n<p>Finding specific data relevant to the domain you want to value can be one of the best means of appraising the domain.<\/p>\n\n\n\n<h3>Automated Appraisals<\/h3>\n\n\n\n<p>There are several services available online that offer automated domain appraisals. These instant appraisals are usually given based on a number of factors such as similar sales, expected traffic, and potential revenue figures. <\/p>\n\n\n\n<p>These automated appraisals can produce wildly unrealistic valuations and tend to only be used as a basic guide for the potential value of a domain. They shouldn’t be used as a definitive resource for valuations.<\/p>\n\n\n\n<h3>Consult an Expert<\/h3>\n\n\n\n<p>An expert in the field of domain names will likely be able to give you a more accurate appraisal of a domain name based on their experience in buying and selling domain names. Domain brokers are industry experts who may be able to perform this task for you.<\/p>\n\n\n\n<p>Tom Brandes, the co-founder of T.B Solutions, recommends looking into the history of a domain name to help you to get a better idea of its value: “…When it was first registered? Is it currently in use? If not, for how many years it's not in use? Is the domain for sale? If so, for how long?”<\/p>\n\n\n\n<h2>What Is a Domain Broker?<\/h2>\n\n\n\n<p>A good domain name broker can make the world of difference in a domain name transaction. Using a domain name broker to help you to acquire a domain name (a domain buyer broker) can take the stress of negotiating a deal out of your hands. <\/p>\n\n\n\n<p>A domain buyer broker can also track down hard to reach domain owners, and offer advice during the purchase process based on their years of experience.<\/p>\n\n\n\n<p>Domain broker Anthony Tampero gives this definition of a domain name broker: “A Domain Broker is basically the middleman between the domain name owner (the seller) and the individual interested in said domain name (the buyer).”<\/p>\n\n\n\n<p>A domain buyer broker can also track down hard to reach domain owners, and offer advice during the purchase process based on their years of experience.<\/p>\n\n\n\n<p>From an initial inquiry through to closing the escrow process, a domain buyer broker will work with you every step of the way to ensure that a domain transaction goes as smoothly as possible. The buyer broker will also facilitate the domain transfer, something that can otherwise be a daunting task alone.<\/p>\n\n\n\n<p>All of this is done for a small fee that is usually worked out as a commission based on the final sales price. For example, they may charge you 10% of the final sales price.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1920\" height=\"371\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/brokers-image.svg\" alt=\"\" class=\"wp-image-195\"\/><\/figure>\n\n\n\n<h2>When to Use a Domain Broker<\/h2>\n\n\n\n<p>When you’re considering buying a high value .COM domain name, you have two options. You can try to acquire the domain independently, or you can use the services of a domain buyer broker. <\/p>\n\n\n\n<p>You may be comfortable with the idea of buying a domain name, and you may be confident of being able to close a deal to acquire your domain without needing to use a third party to work on your behalf.<\/p>\n\n\n\n<p>Matthew Soehl, the founder of High Street Domains, definitely recommends using a domain broker: “My top 3 pieces of advice are Hire a Broker, Hire a Broker, Hire a Broker. Just like when you are buying a house you hire a Real Estate Broker, this is no different. Domain Brokers are professional brokers for domain name assets. And just like a Realtor has access to the MLS, Domain Brokers have access to domain sales data, 80% of which is not publicly reported.”<\/p>\n\n\n\n<p>There are several reasons why you may want to consider using a domain name broker:<\/p>\n\n\n\n<h3>You don’t know how much money to spend<\/h3>\n\n\n\n<p>A good domain buyer broker will be able to advise you on how much money it’s likely to take to acquire a specific domain name. The broker will be able to use their existing knowledge and expertise to give you an informed, impartial viewpoint on a domain’s value.<\/p>\n\n\n\n<h3>You can’t find the owner of the domain name<\/h3>\n\n\n\n<p>This is a common problem. Since GDPR came into being a couple of years ago, many domain ownership details have been redacted from the Internet. This means that in some situations, it is almost impossible for a standard Internet user to find the true owner of a domain name. A domain buyer broker can use a suite of premium tools to track down the real owner of a domain and contact them on your behalf.<\/p>\n\n\n\n<h3>You have never bought a domain before<\/h3>\n\n\n\n<p>If you have never acquired a domain name before, it may be worthwhile consulting a domain buyer broker. A good broker will be able to guide you through the entire process, and will only earn their commission when the desired domain is sitting in your account.  <\/p>\n\n\n\n<p>According to Matthew Soehl: “Half of the headaches happen in transferring the domain from one party to another. A professional Domain Broker has probably seen all of the issues you will encounter and can make the process as smooth as possible.”<\/p>\n\n\n\n<h2>How to Find a Good Domain Broker<\/h2>\n\n\n\n<p>A good domain broker can be hard to find. The most reliable means of finding a reputable domain broker is to ask for recommendations within your professional network. If anyone you know has used the services of a domain buyer broker, it’s worth asking them whether they’d recommend using them.<\/p>\n\n\n\n<p>Many domain brokers work almost exclusively on referrals, so asking your professional network should definitely be your first port of call. Alternatively, you can consult a list of recommended domain brokers from a reputable website. Sites such as <a target=\"_blank\" href=\"https:\/\/www.domainsherpa.com\/domain-name-brokers\/\" rel=\"noopener noreferrer\">DomainSherpa<\/a> or <a target=\"_blank\" href=\"https:\/\/domaininvesting.com\/guide\/list-of-domain-brokers\/\" rel=\"noopener noreferrer\">DomainInvesting.com<\/a> offer lists of domain name brokers that the publishers have either used personally or have been highly recommended. <\/p>\n\n\n\n<p>Matthew Soehl gives the following advice: “When looking for a Domain Broker it is always best to call them on the phone. They will be able to get a handle on what you are trying to do and what your budget is. You will also get a feel of whether or not it is a good fit.”<\/p>\n\n\n\n<h2>How to Safely Perform a Domain Transaction<\/h2>\n\n\n\n<p>Performing a domain name transaction can be a tricky business. There are certain risks involved in deals involving these digital assets. Working with either a domain name broker or a marketplace can mitigate some of these risks, but if you decide to buy a domain name privately, directly from the owner, how can you safely perform the transaction?<\/p>\n\n\n\n<p>An escrow can help immensely. A good domain escrow company will act as the middleman between yourself and the domain seller to ensure that a domain transaction goes smoothly. For a relatively small fee, the escrow company will collect, hold, and only disburse funds when both buyer and seller are satisfied with the deal.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1920\" height=\"371\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/secure-payment-image-new.svg\" alt=\"\" class=\"wp-image-193\"\/><\/figure>\n\n\n\n<p>Fortunately, there are several escrow solutions available. One of the most popular, reputable solutions is Escrow.com, a California-based company that offers specialist domain name escrow services. According to the company’s home page, domains such as Uber.com, and SnapChat.com have been purchased using Escrow.com as a middleman. Overall, the company has processed over $3.5 billion worth of transactions via its platform.<\/p>\n\n\n\n<p>Alternatively, you could use the services of a specialist domain name attorney to buy a high-value .COM domain. A prominent example is Escrow.domains, a service offered by intellectual property law firm Greenberg &amp; Lieberman. The service offers a domain name escrow that is overseen and controlled by an attorney. <\/p>\n\n\n\n<p>Whilst escrow companies can help you to securely acquire a domain name, they do not offer basic legal provisions to protect you in the event that the domain name you acquired was sold illegally, for example. <\/p>\n\n\n\n<p>A specific domain sales agreement, as well as the use of an escrow service, can offer an extra layer of protection that is often required in high-value domain transactions.<\/p>\n\n\n\n<h2>Expert Interviews<\/h2>\n\n\n\n<p>During our research for this article, we consulted three domain name experts in our network to help us answer some of the most pressing questions about domain names. Here, we have included their answers in full.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><strong><a target=\"_blank\" href=\"https:\/\/www.linkedin.com\/in\/tb-solutions\/\" rel=\"noopener noreferrer\">Tom Brandes<\/a> <\/strong><br><strong>Co-founder of T.B. Solutions - SEO Domains. Premium Domain Broker &amp; Investor.<\/strong><\/p>\n\n\n\n<p>Well, my advice\/input would be:<br>Before approaching the process of negotiating a premium domain deal, it's important to do some basic analysis to know the real market value of the domain. <\/p>\n\n\n\n<p>Here are some recommended checks: <br> A.    Main domain analysis - when it was first registered? is it currently in use? if not, for how many years it's not in use? is the domain for sale? if so, for how long? Etc.<br> B.    How many other common TLDs are taken and for how long? <br> C.    How many unique and significant companies are using this name? <br> D.    Historic sales of similar domains, including other TLDs. <br> E.    Current prices of similar domains, including other TLDs.<\/p>\n\n\n\n<p><br>If done properly, you should be able to know how to set your maximum budget appropriately and even more importantly, you get some important fact-based arguments you can use during the negotiation.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><strong><a target=\"_blank\" href=\"https:\/\/www.linkedin.com\/in\/anthony-tampero-b707b9199\/\" rel=\"noopener noreferrer\">Anthony Tampero<\/a> <\/strong><br><strong>Domain Name Broker<\/strong><\/p>\n\n\n\n<p>On when to use a marketplace:<br>These marketplaces are great for when you've had the chance to acquire a great domain name and want to auction it out on a platform viewed by many. You can also use GoDaddy for that, and most prefer Afternic among the 3 you listed.<\/p>\n\n\n\n<p>On when to use an independent domain broker:<br>It's best to use an independent broker when you're sitting on a gem of a domain name and are seeking expert help to make a big sale.<\/p>\n\n\n\n<p>On the definition of a domain broker:<br>A Domain Broker is basically the middleman between the domain name owner (the seller) and the individual interested in said domain name (the buyer). <\/p>\n\n\n\n<p>On how to find a good domain broker:<br>Google, as usual, is your best bet. See this article for more details: https:\/\/domaininvesting.com\/guide\/list-of-domain-brokers\/ <\/p>\n\n\n\n<p>On how to evaluate the domain:<br>A domain broker would be best to help you appraise your domain name. But there are many factors involved, from the length of the domain name to relevance and words used.<\/p>\n\n\n\n<p>On how to make the transfer in a safe way :<br>Through a domain brokerage service is your best bet if safety is what you're looking for. But as usual, expect some fees with that.<\/p>\n\n\n\n<hr class=\"wp-block-separator is-style-default\"\/>\n\n\n\n<p><strong><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https:\/\/www.linkedin.com\/in\/matthew-soehl-78b50319\/\">Matthew Soehl<\/a><\/strong><br><strong>Founder at High Street Domains <\/strong><\/p>\n\n\n\n<p>My top 3 pieces of advice are Hire a Broker, Hire a Broker, Hire a Broker. Just like when you are buying a house you hire a Real Estate Broker, this is no different. Domain Brokers are professional brokers for domain name assets. And just like a Realtor has access to the MLS, Domain Brokers have access to domain sales data, 80% of which is not publicly reported.<\/p>\n\n\n\n<p>When looking for a Domain Broker it is always best to call them on the phone. They will be able to get a handle on what you are trying to do and what your budget is. You will also get a feel of whether or not it is a good fit.<\/p>\n\n\n\n<p>Consult a Domain Broker when you are looking to value a domain name. They will give you an accurate picture of the market price range for a particular domain. <\/p>\n\n\n\n<p>Again, before you even get to the stage of transferring a domain you should have already contacted a Broker. Half of the headaches happen in transferring the domain from one party to another. A professional Domain Broker has probably seen all of the issues you will encounter and can make the process as smooth as possible. <\/p>\n\n\n\n<p>It is always best to get your company domain name as soon as possible! In fact, you should have had plans to acquire the domain before you ever started or got funding. The longer you wait the more expensive that domain name will become.  <\/p>\n\n\n\n<p>I could go on for days about domains but I guess the big thing to consider when picking out a domain broker is to know who the broker is representing. The big guys have sales teams, the little guys have brokers. Make sure you have a contract that explains commissions or at least know this upfront. The big guys might charge you upfront with no guarantees. A broker will not get paid until the domain name is in your possession\/sell the domain.<\/p>\n\n\n\n<p>Also when considering acquisition value, domain names have many uses, not just the URL. Ask yourself, how much would I\/my company sell this domain for if I\/my company owned it? Often times, it would be a multiple many times over the asking price or they would never sell. This tells you a lot about what the \"Value\" is to you\/your company.<\/p>\n\n\n\n<hr class=\"wp-block-separator is-style-default\"\/>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>In the introduction to this article, we said that there are several potential pitfalls that make buying a high-value domain name problematic. In the writing and expert interviews above, we hope that we have addressed some of these problems.<\/p>\n\n\n\n<p>This article has covered a number of subjects surrounding the acquisition of a domain name, but the general advice from the experts seems to be that it is wise to use the services of a domain buyer broker, especially if it is your first time attempting to acquire a high-value domain name.<\/p>\n\n\n\n<p>A broker should be your first port of call for a domain valuation, and for advice on an appropriate budget for a domain purchase. The broker will also help you to securely close any domain transaction resulting in your acquisition of a certain domain. It can be difficult to find a great domain broker, but fortunately, there are some reputable, unbiased resources available that have been linked to within this article.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>High-value .COM domain names are becoming common acquisitions for existing companies and startups alike. In some cases, organizations are paying seven or even eight-figure fees to purchase a domain. A recent example is that of Voice.com, which was sold by tech giant MicroStrategy for $30 million. With such vast sums of money being spent on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":191,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[25],"tags":[36,34,35,33],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Buy Your Brand Domain Name - Trigger Growth<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Buy Your Brand Domain Name - Trigger Growth\" \/>\n<meta property=\"og:description\" content=\"High-value .COM domain names are becoming common acquisitions for existing companies and startups alike. In some cases, organizations are paying seven or even eight-figure fees to purchase a domain. A recent example is that of Voice.com, which was sold by tech giant MicroStrategy for $30 million. With such vast sums of money being spent on [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/\" \/>\n<meta property=\"og:site_name\" content=\"Trigger Growth\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-04T08:17:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-15T11:04:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Blog-Domain-Name-blog-social-share.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1318\" \/>\n\t<meta property=\"og:image:height\" content=\"776\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Blog-Domain-Name-blog-social-share.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/triggergrowth.com\/#website\",\"url\":\"https:\/\/triggergrowth.com\/\",\"name\":\"Trigger Growth\",\"description\":\"We make websites that create results\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/triggergrowth.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/03\/domain-brokerage-social-share-image.jpg\",\"width\":1318,\"height\":776},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/#webpage\",\"url\":\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/\",\"name\":\"How to Buy Your Brand Domain Name - Trigger Growth\",\"isPartOf\":{\"@id\":\"https:\/\/triggergrowth.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/#primaryimage\"},\"datePublished\":\"2020-05-04T08:17:00+00:00\",\"dateModified\":\"2020-06-15T11:04:48+00:00\",\"author\":{\"@id\":\"https:\/\/triggergrowth.com\/#\/schema\/person\/8aac5907f97377a99942da982c57e60a\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/triggergrowth.com\/blog\/buy-high-value-domain\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/triggergrowth.com\/#\/schema\/person\/8aac5907f97377a99942da982c57e60a\",\"name\":\"kim\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/130"}],"collection":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/comments?post=130"}],"version-history":[{"count":5,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/130\/revisions"}],"predecessor-version":[{"id":445,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/130\/revisions\/445"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/media\/191"}],"wp:attachment":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/media?parent=130"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/categories?post=130"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/tags?post=130"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}