{"id":449,"date":"2020-05-07T19:51:49","date_gmt":"2020-05-07T17:51:49","guid":{"rendered":"https:\/\/triggergrowth.com\/?p=449"},"modified":"2020-06-12T14:49:10","modified_gmt":"2020-06-12T12:49:10","slug":"b2b-live-chat-solution","status":"publish","type":"post","link":"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/","title":{"rendered":"Make a great first impression with a high performing live chat solution"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"658\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot-1024x658.png\" alt=\"\" class=\"wp-image-459\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot-1024x658.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot-300x193.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot-768x493.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot-1536x986.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Over the past year, we have experienced a growing amount of communication through our website, which, in the beginning, was manageable. Our inbox, at the time, was set up in a way that each team member gets a copy of a customer support email. However, the issue with this setup is that it is not always easy to understand who would answer the customer support email.<\/p>\n\n\n\n<p>As you can imagine, this is not the most structured approach to handling support or even pre-sales requests. And for a while, we searched for a better approach to communicate with visitors to our website.<\/p>\n\n\n\n<p>In this story, we will show our approach, findings, frustrations, and some cool tricks we figured out along the way.<\/p>\n\n\n\n<h2>The Problem<\/h2>\n\n\n\n<p>To make it clear what our initial standpoint was, I’m gonna list some of the challenges we experienced.<\/p>\n\n\n\n<p>As already mentioned, although we had different interests, we kept track of who was answering what by placing team members on BCC. You can stop laughing now as I know this is not ideal.<\/p>\n\n\n\n<p>Also, we couldn’t tell which support\/sales agent was answering what email until they hit “send”. At a lower scale, this is not a problem. However, if you start getting a significant amount of emails as with this method, things can quickly grow out of hand. It's not optimal to have no idea of if an email you’re working on is already being answered by someone else.<\/p>\n\n\n\n<p>Another issue we encountered was that people wrote to us via multiple platforms. Some through Facebook messenger, some by filling out the email form on the website and others via direct email through the email link on the website. We encountered cases where some wrote to us on all channels just to be sure that we got the message.<\/p>\n\n\n\n<h2>Our goal<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1261\" height=\"554\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/connection.svg\" alt=\"\" class=\"wp-image-454\"\/><\/figure>\n\n\n\n<p>With these challenges in mind, we started looking for different options. In the beginning, we did not put a lot of effort into this as the problem was not a major obstacle for our business. During that time, we looked at simple shared inbox solutions, but most did not entirely convince us to make the move to change our habits.<\/p>\n\n\n\n<p>Initially, we listed some requirements that our dream solution would meet.<\/p>\n\n\n\n<ul><li>Handling multiple accounts\/projects, both internal and for clients. We wanted a tool that could handle the complexity of multiple website domains.<\/li><li>With more domains and more communication also comes more support and sales agents. We were in search of a tool that could handle different people working on different projects and some people working on all projects - each with their permission settings.<\/li><li>Integrate with different platforms we use for marketing, sales, development, and similar.<\/li><li>Moving from an email-only system to one that also has a live chat feature. From personal experience, I know that I am much more likely to reach out to a company if their live chat seems online, and there is a person on the other end. If I’m browsing a website, and it only has a simple contact form and no assurance of how long I will have to wait, I might just continue browsing.<\/li><li>Merging all the conversations into one inbox. To solve the issue with communication through multiple channels, we would also like to have an integration with Facebook messenger.<\/li><li>Improve conversion rates by implementing automated triggered messages. These messages pop out based on a visitor’s usage behavior, such as the time spent on a particular page or the fact that they just landed on the pricing page. We know from popular growth hacking statistics that these features can drive new business.<\/li><li>Should work great on desktop and mobile, having high-performing apps for Windows, Mac, iOS, and android.<\/li><\/ul>\n\n\n\n<h2>Methodology<\/h2>\n\n\n\n<p>With our problems and goals in mind, we began scouring the internet for a tool that can help us with our growing challenge.<\/p>\n\n\n\n<p>In search of answers, we looked at major review sites, software comparison sites, and popular tech sharing sites. To be more specific, we browsed through sites such as <a rel=\"noreferrer noopener\" href=\"https:\/\/www.g2.com\/\" target=\"_blank\">G2 Crowd<\/a>, <a rel=\"noreferrer noopener\" href=\"https:\/\/stackshare.io\/\" target=\"_blank\">StackShare<\/a>, <a rel=\"noreferrer noopener\" href=\"https:\/\/alternativeto.net\/\" target=\"_blank\">AlternativeTo<\/a>, and <a rel=\"noreferrer noopener\" href=\"https:\/\/www.producthunt.com\/\" target=\"_blank\">Product Hunt<\/a>.<\/p>\n\n\n\n<p>We shortlisted around 5 of the most promising services and set up meetings with their sales departments. In some cases, we even installed a free trial on a WordPress sandbox installation so we could actually try the features in a real-world scenario.<\/p>\n\n\n\n<h2>Tools<\/h2>\n\n\n\n<p>Here are tools you might want to consider in your sales and support set up. These tools stood out during our process, and throughout this list, we will add our thoughts and recommendations. In the end, we will state which one of these tools we chose and why.<\/p>\n\n\n\n<h3>Intercom<\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"563\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-1024x563.png\" alt=\"\" class=\"wp-image-458\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-1024x563.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-300x165.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-768x423.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-1536x845.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog-2048x1127.png 2048w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/intercom-homepage-blog.png 2110w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>One of the tools we all had at the top of our mind is Intercom. <a href=\"https:\/\/www.intercom.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Intercom<\/a> delivers one of the most incredible live chat experiences to website customers. It possesses great features for delivering automatically triggered messages in the chat, pop-ups, and via email. The trigger messages can be targeted based on user information and behavior, making Intercom a really strong sales catalyst.<\/p>\n\n\n\n<p>For these features, many SaaS companies utilize Intercom. The amount of data that you can attach to a customer in Intercom makes it almost a fully-fledged CRM system.<\/p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"Tracking your user data with Intercom\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/5OeDenPhfD0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<p>Without a doubt, it is a great tool at scale and for inbound chat conversations. However, their pricing is configured in a way that the cost of having a simple live chat can quickly grow out of hand. That is also what we hear from people in SaaS Growth Hack communities.<\/p>\n\n\n\n<p>The basic plan starts at 39 USD per month and includes one seat and a reach of up to 2000 unique visitors per month. Sounds good, right? Well, it depends on your needs. The price goes up really fast if you need more support agents or need to reach out to more people, and it also depends on which add-ons you plan to use.<\/p>\n\n\n\n<h3>Crisp<\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"566\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-1024x566.png\" alt=\"\" class=\"wp-image-455\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-1024x566.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-300x166.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-768x425.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-1536x849.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog-2048x1132.png 2048w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/crisp-homepage-blog.png 2100w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/crisp.chat\/en\/\" target=\"_blank\">Crisp<\/a> is an excellent tool used by a bunch of websites. With this tool, you get a loan for free, and it scales affordably with more customer support agents. However, some features, such as API integration, and trigger messages are only included in their highest pricing plan. While the plan is priced fairly at around 100 USD, it is still considerably more-pricey compared to its interesting alternatives.<\/p>\n\n\n\n<h3>Tawk.to<\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"566\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-1024x566.png\" alt=\"\" class=\"wp-image-460\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-1024x566.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-300x166.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-768x425.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-1536x849.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog-2048x1132.png 2048w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/tawkto-homepage-blog.png 2100w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.tawk.to\/\" target=\"_blank\">Tawk.to<\/a> has a really interesting business model. The tool itself is free. You can implement it on your website, and off you go.<\/p>\n\n\n\n<p>They have a bunch of features, however, it is not as involved and comprehensive as some of the alternatives that will be introduced here. Still, I like their approach a lot. The way they make money is by offering flat-rates for customer support agents to answer your customer support tickets.<\/p>\n\n\n\n<p>Even though their solution is cool, they don’t compare with the solution we ended up with.<\/p>\n\n\n\n<h3>Zendesk<\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"566\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-1024x566.png\" alt=\"\" class=\"wp-image-461\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-1024x566.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-300x166.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-768x425.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-1536x849.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog-2048x1132.png 2048w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/zendesk-homepage-blog.png 2100w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.zendesk.com\/\" target=\"_blank\">Zendesk<\/a> is one of the old heavy hitters and has been around for ages with stats on <a rel=\"noreferrer noopener\" href=\"https:\/\/builtwith.com\/\" target=\"_blank\">BuiltWith<\/a> that shows they have a huge market share. They are close to our hearts since Zendesk was founded by Danish entrepreneurs.<\/p>\n\n\n\n<p>This brand’s focus has always been customer support, but in more recent years, it has quietly emerged with some interesting software solutions in one offering.<\/p>\n\n\n\n<p>However, we felt a bit confused by their features and pricing plans, and the user interface of the live chat didn’t appeal to our design requirements. Previously mentioned alternative, Intercom, almost draws you in with their beautiful live chat, making a customer want to start a conversation with the company. On the other hand, Zendesk had the opposite effect with a feel that was more like a typical email form.<\/p>\n\n\n\n<h3>HubSpot<\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"566\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-1024x566.png\" alt=\"\" class=\"wp-image-457\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-1024x566.png 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-300x166.png 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-768x425.png 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-1536x849.png 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog-2048x1132.png 2048w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/hubspot-homepage-blog.png 2100w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.hubspot.com\/\" target=\"_blank\">HubSpot<\/a> has been around for a long time. They used to have a great focus on marketing and connecting all the data, giving the marketer a great overview of the performance of the campaign. At least that was the impression we had with HubSpot. But when checking them out more thoroughly, it became apparent that they not only offer solutions to marketing but also sales and support.<\/p>\n\n\n\n<p>It seems they have found a magical way of connecting the different customer-facing areas of a company. With the built-in CRM system, you can follow a single customer from the first time they see or interact with your ad, and throughout the sales processes to customer support once they decide to use your products.<\/p>\n\n\n\n<p>Their solution offers a lot of integrations and access to API, and all of that is part of the free plan. Yes, you read it right.. Their foundation plan is a free CRM along with a free shared email inbox and a free live chat solution. If your company is looking to do primarily sales with their CRM, then you can upgrade that particular part of their offering to a higher plan.<\/p>\n\n\n\n<p>We feel that they are offering a mature, solid, and fairly priced solution that grows as your company grows. HubSpot's highest plans are fairly pricey, but the number of features you get at those plans should allow you to create some highly-advanced marketing automation, and hopefully, be able to return some of that investment.<\/p>\n\n\n\n<p>Lastly, they have great control over permissions of each of your support or sales agents. You can control access to almost any feature inside the dashboard, and this feature is also free. Since we run multiple projects, we were also happy to know that it is possible to have multiple accounts or websites connected to the same user agent account. That means login once and manage all the projects you are connected to.<\/p>\n\n\n\n<p><em>*We decided to go with HubSpot. Below, you’ll see why it works for us<\/em><\/p>\n\n\n\n<h2>Findings<\/h2>\n\n\n\n<p>After we went through this scouting process, we uncovered some findings that we thought you might find interesting in your research process.<\/p>\n\n\n\n<p>For example, we found out that API integrations can be the determining factor for which plan you have to use, in order to get access to this feature. This may not be a deciding factor for you, but if you do consider that API integration is a must, you might want to take a look at pricing tables more closely to ensure that the plan you are looking to sign up for, has this feature enabled.<\/p>\n\n\n\n<p>The approach to pricing varies a lot between different services. Some services base the pricing plans on the amount of contacts you create in their CRM, some on the number of support agents in your department, and some on functionality such as API integration. Depending on whether you are selling at scale or at a low volume but higher deal values, you might want to go in a certain direction to lower your cost.<\/p>\n\n\n\n<h2>Our tool of choice - HubSpot<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"672\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot-1024x672.jpg\" alt=\"\" class=\"wp-image-456\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot-1024x672.jpg 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot-300x197.jpg 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot-768x504.jpg 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot-1536x1007.jpg 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/HubSpot.jpg 1921w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>We are genuinely impressed by the number of features that HubSpot provides free of charge. Simply put, HubSpot can do it all. Well, almost everything. Here is a short list of the things that made us choose this service.<\/p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\">\n<p><strong>Features we got<\/strong> ✔️<\/p>\n\n\n\n<ul><li>Marketing<\/li><li>Sales<\/li><li>Support (tickets)<\/li><li>Integrations and API is free<\/li><li>Live chat is free<\/li><li>It replaces Albacross’ prospecting feature<\/li><li>Has advanced permission management<\/li><li>Connects with slack for quicker responses<\/li><li>iOS and Android apps<\/li><\/ul>\n<\/div>\n\n\n\n<div class=\"wp-block-column\">\n<p><strong>Features we didn’t get<\/strong> ❌<\/p>\n\n\n\n<ul><li>Windows and Mac apps<\/li><li>Triggers<\/li><\/ul>\n\n\n\n<p><\/p>\n<\/div>\n<\/div>\n\n\n\n<h3>Automated trigger messages require a premium plan<\/h3>\n\n\n\n<p>One of the things that we were hoping to get with the new solution was a way to trigger messages on the website and thereby interact with potential customers. Although automatic messages are available, they are placed under the premium plan, so you’ll have to pay for it. I just thought you should know that we didn’t end up check-marking all the boxes.<\/p>\n\n\n\n<h3>How to run it as an app on desktop:<\/h3>\n\n\n\n<p>As mentioned earlier, we were aiming for a smooth set up for chatting with our customers directly from our desktop. HubSpot offers a free iOS and Android app; however, they don’t have an app for Windows or Mac. So, I just wanted to leave you with a quick tip if you decide to set up a chat solution for your website. With modern web technology, you can load any website into an app container and make a website feel like it was an app.<\/p>\n\n\n\n<p>To do this, you can try out some of these services:<\/p>\n\n\n\n<ul><li><a href=\"https:\/\/getstation.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Station<\/a><\/li><li><a href=\"https:\/\/tryshift.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Shift<\/a><\/li><li><a href=\"https:\/\/fluidapp.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Fluid<\/a><\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"679\" src=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app-1024x679.jpg\" alt=\"\" class=\"wp-image-477\" srcset=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app-1024x679.jpg 1024w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app-300x199.jpg 300w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app-768x509.jpg 768w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app-1536x1019.jpg 1536w, https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Trigger-Growth-HubSpot-live-chat-in-fluid-app.jpg 1800w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption>HubSpot conversations window in Fluid for MacOS.<\/figcaption><\/figure>\n\n\n\n<p>The benefit is that you’ll be able to get a native macOS or Windows notifications and have the window open at all times, tapping between that window and your other open apps. Since it has its own little container, you can have multiple instances of HubSpot open, with each having their separate website chat.<\/p>\n\n\n\n<p>Again, this is super relevant if you are running more than one website.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>There are many customer support and live chat solutions out there. Many of which are cheap or even free. Also, many of them feel like they haven’t matured enough and simple features just don’t perform as you would hope. On the other hand, you will find very mature solutions that can add a tremendous amount of value to your business.<\/p>\n\n\n\n<p>In this article, we have shared how we decided to go with HubSpot. Their solution allows us to scale the three pillars of business - sales, support, marketing independently, giving an interesting set up that can adapt to the specific needs of any business.<\/p>\n\n\n\n<p>If you are looking to add a live chat solution to your website or you’re curious about how we can integrate it with your existing platforms and your existing data, please <a href=\"https:\/\/triggergrowth.com\/request-pricing\/\">reach out to us<\/a>.<\/p>\n\n\n\n<p>We would be happy to make sure you get the most out of HubSpot or similar solutions on your website.<\/p>\n\n\n\n<p>Looking forward to hearing from you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the past year, we have experienced a growing amount of communication through our website, which, in the beginning, was manageable. Our inbox, at the time, was set up in a way that each team member gets a copy of a customer support email. However, the issue with this setup is that it is not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":459,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[23],"tags":[26,30,29],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Make a great first impression with a high performing live chat solution - Trigger Growth<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Make a great first impression with a high performing live chat solution - Trigger Growth\" \/>\n<meta property=\"og:description\" content=\"Over the past year, we have experienced a growing amount of communication through our website, which, in the beginning, was manageable. Our inbox, at the time, was set up in a way that each team member gets a copy of a customer support email. However, the issue with this setup is that it is not [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/\" \/>\n<meta property=\"og:site_name\" content=\"Trigger Growth\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-07T17:51:49+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-12T12:49:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/Live-Chat-Solutions-blog-social-share.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1318\" \/>\n\t<meta property=\"og:image:height\" content=\"776\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/triggergrowth.com\/#website\",\"url\":\"https:\/\/triggergrowth.com\/\",\"name\":\"Trigger Growth\",\"description\":\"We make websites that create results\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/triggergrowth.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/triggergrowth.com\/wp-content\/uploads\/2020\/05\/mockup-hubspot.png\",\"width\":1920,\"height\":1233},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/#webpage\",\"url\":\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/\",\"name\":\"Make a great first impression with a high performing live chat solution - Trigger Growth\",\"isPartOf\":{\"@id\":\"https:\/\/triggergrowth.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/#primaryimage\"},\"datePublished\":\"2020-05-07T17:51:49+00:00\",\"dateModified\":\"2020-06-12T12:49:10+00:00\",\"author\":{\"@id\":\"https:\/\/triggergrowth.com\/#\/schema\/person\/8aac5907f97377a99942da982c57e60a\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/triggergrowth.com\/blog\/b2b-live-chat-solution\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/triggergrowth.com\/#\/schema\/person\/8aac5907f97377a99942da982c57e60a\",\"name\":\"kim\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/449"}],"collection":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/comments?post=449"}],"version-history":[{"count":5,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/449\/revisions"}],"predecessor-version":[{"id":479,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/posts\/449\/revisions\/479"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/media\/459"}],"wp:attachment":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/media?parent=449"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/categories?post=449"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/tags?post=449"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}