{"id":3,"date":"2020-03-12T10:52:51","date_gmt":"2020-03-12T09:52:51","guid":{"rendered":"https:\/\/triggergrowth.com\/?page_id=3"},"modified":"2020-06-07T18:36:31","modified_gmt":"2020-06-07T16:36:31","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/triggergrowth.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>The Privacy Policy explains how Trigger Growth ApS (\"Trigger Growth\", \"we\", \"us\", and\"ours\") handle personal data and use cookies and similar technologies to recognize you (\"visitor\", \"user\") when you visit our websites at <a href=\"https:\/\/triggergrowth.com\">https:\/\/triggergrowth.com<\/a> (\"Websites\"). It explains what these technologies are and why we use them, as well as your rights to control our use of them.<\/p>\n<div id=\"ez-toc-container\" class=\"ez-toc-v2_0_11 counter-hierarchy counter-decimal\">\n<div class=\"ez-toc-title-container\">\n<p class=\"ez-toc-title\">Table of Contents<\/p>\n<span class=\"ez-toc-title-toggle\"><\/span><\/div>\n<nav><ul class=\"ez-toc-list ez-toc-list-level-1\"><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-1\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#what-information-we-collect-about-you\" title=\"What Information We Collect About You\">What Information We Collect About You<\/a><ul class=\"ez-toc-list-level-3\"><li class=\"ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-2\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#when-you-visit-our-website\" title=\"When You Visit Our Website\">When You Visit Our Website<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-3\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#personal-data-that-you-provide-voluntarily\" title=\"Personal Data That You Provide Voluntarily\">Personal Data That You Provide Voluntarily<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-4\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#other-information\" title=\"Other Information\">Other Information<\/a><\/li><\/ul><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-5\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#how-we-use-collected-personal-information\" title=\"How We Use Collected Personal Information\">How We Use Collected Personal Information<\/a><ul class=\"ez-toc-list-level-3\"><li class=\"ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-6\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#compliance-with-our-privacy-policy\" title=\"Compliance with Our Privacy Policy\">Compliance with Our Privacy Policy<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-7\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#we-never-sell-personal-information\" title=\"We Never Sell Personal Information\">We Never Sell Personal Information<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-8\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#use-of-personal-information\" title=\"Use of Personal Information\">Use of Personal Information<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-9\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#retention-of-personal-information\" title=\"Retention of Personal Information\">Retention of Personal Information<\/a><\/li><\/ul><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-10\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#cookies-and-similar-technologies\" title=\"Cookies And Similar Technologies\">Cookies And Similar Technologies<\/a><ul class=\"ez-toc-list-level-3\"><li class=\"ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-11\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#cookies\" title=\"Cookies\">Cookies<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-12\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#what-about-other-tracking-technologies,-like-web-beacons\" title=\"What about other tracking technologies, like web beacons?\">What about other tracking technologies, like web beacons?<\/a><\/li><\/ul><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-13\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#do-you-serve-targeted-advertising\" title=\"Do you serve targeted advertising?\">Do you serve targeted advertising?<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-14\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#what-rights-you-have-over-your-data\" title=\"What Rights You Have Over Your Data\">What Rights You Have Over Your Data<\/a><ul class=\"ez-toc-list-level-3\"><li class=\"ez-toc-heading-level-3\"><a class=\"ez-toc-link ez-toc-heading-15\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#how-to-exercise-these-rights\" title=\"How to exercise these rights\">How to exercise these rights<\/a><\/li><\/ul><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-16\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#how-often-will-you-update-this-privacy-policy\" title=\"How often will you update this Privacy Policy?\">How often will you update this Privacy Policy?<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-17\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#where-can-i-get-further-information\" title=\"Where can I get further information?\">Where can I get further information?<\/a><\/li><li class=\"ez-toc-page-1 ez-toc-heading-level-2\"><a class=\"ez-toc-link ez-toc-heading-18\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/#contact-information\" title=\"Contact information\">Contact information<\/a><\/li><\/ul><\/nav><\/div>\n\n<h2><span class=\"ez-toc-section\" id=\"what-information-we-collect-about-you\"><\/span>What Information We Collect About You<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>When you interact with us through our website, we may collect Personal Data, Usage Data, and other information from you, as further described below:<\/p>\n<h3><span class=\"ez-toc-section\" id=\"when-you-visit-our-website\"><\/span>When You Visit Our Website<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>You are free to explore the website without providing any Personal Information about yourself (which we will refer to in this privacy policy as \"Personal Data\").<\/p>\n<p>However, we automatically collect certain information to help us understand how visitors use our website (which we will refer to in this privacy policy as \"Usage Data\"). Please see the \"<a href=\"#log-files\">Log Files<\/a>\" section below.<\/p>\n<h3><span class=\"ez-toc-section\" id=\"personal-data-that-you-provide-voluntarily\"><\/span>Personal Data That You Provide Voluntarily<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>We are committed to ensuring that your information is secure. To prevent unauthorized access or disclosure, we have put in place suitable physical, electronic, and managerial procedures to safeguard and secure the information we collect online.<\/p>\n<p>We collect Personal Data from you when you voluntarily provide information, such as when you contact us through a contact form or register on our website.<\/p>\n<p>This refers to any information that you voluntarily submit to us, and that identifies you personally, including contact information, such as your name, email address, company name, address, phone number, and other information about yourself or your business.<\/p>\n<h3><span class=\"ez-toc-section\" id=\"other-information\"><\/span>Other Information<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>We also collect, generate, and receive other information:<\/p>\n<h4>Cookies<\/h4>\n<p>Cookies help make our website more user-friendly, efficient, and secure.<br \/>\nCookies are small text files that are stored on your computer and saved by your browser. Most of the cookies we use are so-called \"session cookies.\" They are automatically deleted after your visit.<\/p>\n<p>Other cookies remain in your device's memory until you delete them. These cookies make it possible to recognize your browser when you next visit the site.<\/p>\n<p>You can configure your browser to inform you about the use of cookies so that you can decide on a case-by-case basis, whether to accept or reject a cookie.<\/p>\n<p>Alternatively, you can configure your browser to accept cookies under certain conditions automatically, to always reject them, or to automatically delete cookies when closing your browser.<\/p>\n<p>Disabling cookies may limit the functionality of this website.<\/p>\n<p>For more information, please see <span style=\"color: #000000;\">\"<a href=\"https:\/\/triggergrowth.com\/privacy-policy\/?preview=true#cookies\">Cookies<\/a>\"<\/span> section below.<\/p>\n<h4>Contact Forms<\/h4>\n<p>If you fill out a contact form on our website, we store the information both on our website and in our email inbox.<\/p>\n<h4 id=\"log-files\">Log Files<\/h4>\n<p>When you view content provided by us, we automatically collect information about your computer hardware and software.<\/p>\n<p>This information can include your IP address, browser type, domain names, internet service provider (ISP), the files viewed on our site (e.g., HTML pages, graphics, etc.), operating system, clickstream data, access times and referring website addresses. This information is used by Trigger Growth to provide general statistics regarding use of the Websites. For these purposes, we do link this automatically-collected data to other Personal Information such as name, email address, address, and phone number.<\/p>\n<h4>Website Analytics<\/h4>\n<p>Google Analytics collects information about visitor behavior on our website. Google Analytics stores information about what pages you visit, how long you are on the site, how you got here, and what you click. Google may use the Data collected to contextualize and personalize the ads of its own advertising network.<\/p>\n<h4>Marketing - Facebook Ads conversion tracking (Facebook pixel):<\/h4>\n<p>Facebook Ads conversion tracking (Facebook pixel) is an analytics service provided by Facebook, Inc. that connects data from the Facebook advertising network with actions performed on this website. The Facebook pixel tracks conversions that can be attributed to ads on Facebook, Instagram, and Audience Network.<\/p>\n<h4>Customer Testimonials and Comments:<\/h4>\n<p>We post customer testimonials and comments on our Websites, which may contain Personal Information. We obtain each customer's consent via email before posting the customer's name and testimonial.<\/p>\n<h4>Newsletter:<\/h4>\n<p>We use MailPoet, a WordPress-based newsletter plugin that collects names and emails from users who opt-in to subscribe to our newsletter. Subscriber data is hosted on our secure web server. This Data will be stored indefinitely unless the User unsubscribes or requests us to delete their data.<\/p>\n<h4>Embedded Content From Other Websites<\/h4>\n<p>Our Websites provide links to other websites of third parties. We do not control and are not responsible for the content or practices of these other websites. Our provision of such links does not constitute our endorsement of these other websites, their content, their owners, or their practices.<\/p>\n<p>This Privacy Policy does not apply to these other websites, which are subject to any privacy and other policies they may have.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"how-we-use-collected-personal-information\"><\/span>How We Use Collected Personal Information<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<h3><span class=\"ez-toc-section\" id=\"compliance-with-our-privacy-policy\"><\/span>Compliance with Our Privacy Policy<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>We use the information we collect only per this Privacy Policy.<\/p>\n<p>Customers who subscribe to our Subscription Services are obligated through our agreements with them to comply with this Privacy Policy.<\/p>\n<h3><span class=\"ez-toc-section\" id=\"we-never-sell-personal-information\"><\/span>We Never Sell Personal Information<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>We will never sell your Personal Information to any third party.<\/p>\n<h3><span class=\"ez-toc-section\" id=\"use-of-personal-information\"><\/span>Use of Personal Information<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>In addition to the uses identified elsewhere in this Privacy Policy, we may use your Personal Information to:<\/p>\n<ul>\n<li>Improve your experience by personalizing and improving the Websites and Subscription Service;<\/li>\n<li>Send information or content to you which we think may be of interest to you by post, email, or other means and send you marketing communications relating to our business;<\/li>\n<li>Promote the use of our services to you and share promotional and information content with you in accordance with your communication preferences;<\/li>\n<li>Provide other companies with statistical information about our users - but this information will not be used to identify any individual user and will only be shared on an aggregate and de-identified basis;<\/li>\n<li>Contact you about billing, account management, and other administrative matters;<\/li>\n<li>Send information to you regarding changes to our Customer Terms of Service, Privacy Policy (including the Cookie Policy), or other legal agreements;<\/li>\n<li>Investigate and help prevent security issues and abuse; and<\/li>\n<li>Meet legal requirements.<\/li>\n<\/ul>\n<h3><span class=\"ez-toc-section\" id=\"retention-of-personal-information\"><\/span>Retention of Personal Information<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>For users that register on our website (if any), we also store the personal information they provide in their user profile.<\/p>\n<p>All users can request access, correction, updates or deletion of their personal data at any time (except they cannot change their username).<\/p>\n<p>Website administrators can also see and edit that information.<\/p>\n<p>How long we keep information we collect about you depends on the type of information, as described in further detail below. After such time, we will either delete or anonymize your information or, if this is not possible, then we will securely store your information and isolate it from any further use until deletion is possible.<\/p>\n<p>We retain Personal Information that you provide to us where we have an ongoing legitimate business need to do so (for example, as required to comply with our legal obligations, resolve disputes, and enforce our agreements).<\/p>\n<p>When we have no ongoing legitimate business need to process your Personal Information, we securely delete the information or anonymize it or, if this is not possible, safely store your Personal Information and isolate it from any further processing until deletion is possible. We will delete this information at an earlier date if you so request, as described in the \"<a href=\"https:\/\/triggergrowth.com\/privacy-policy\/?preview=true#what-rights-you-have-over-your-data\">What Rights You Have Over Your Data<\/a>\" section below.<\/p>\n<p>If you have elected to receive marketing communications from us, we retain information about your marketing preferences for a reasonable period of time from the date you last expressed interest in our content, or services, such as when you last opened an email from us. We retain information derived from cookies and other tracking technologies for a reasonable period of time from the date such information was created.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"cookies-and-similar-technologies\"><\/span>Cookies And Similar Technologies<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<h3><span class=\"ez-toc-section\" id=\"cookies\"><\/span>Cookies<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>You can at any time change or withdraw your consent from the Cookie Declaration on our website.<\/p>\n<p>Your consent applies to the following domains: triggergrowth.com<\/p>\n<div class=\"wt-cli-element cli_user_consent_state\">Your current state: No consent given. <a class=\"cli_manage_current_consent\" style=\"cursor:pointer;\">Manage your consent.<\/a> <\/div>\n<h4><\/h4>\n<h4>What Are Cookies?<\/h4>\n<p>Cookies are small data files that are placed on your computer or mobile device when you visit a website. Cookies are widely used by website owners in order to make their websites work or to work more efficiently, as well as to provide reporting information.<\/p>\n<p>Cookies set by the website owner (in this case, Trigger Growth) are called \"first-party cookies\".<\/p>\n<p>Cookies set by parties other than the website owner are called \"third-party cookies\".<\/p>\n<p>Third-party cookies enable third party features or functionality to be provided on or through the website (e.g. like advertising, interactive content, and analytics).<\/p>\n<p>The parties that set these third party cookies can recognize your computer both when it visits the website in question and also when it visits certain other websites.<\/p>\n<h4>Why Do We Use Cookies?<\/h4>\n<p>We use first and third-party cookies for several reasons. Some cookies are required for technical reasons in order for our Websites to operate, and we refer to these as \"essential\" or \"strictly necessary\" cookies. Other cookies also enable us to track and target the interests of our users to enhance the experience on our Online Properties. Third parties serve cookies through our Websites for advertising, analytics and other purposes. This is described in more detail below.<\/p>\n<p>The specific types of first and third-party cookies served through our Websites and the purposes they perform are described below (please note that the specific cookies served may vary depending on the specific Online Properties you visit).<\/p>\n<h4 id=\"what-types-of-cookies-do-we-use\">What Types of Cookies Do We Use?<\/h4>\n<p>The cookies used on our website are grouped into the following categories.<br \/>\n<div class=\"wt-cli-element cli_cookie_category_single\"><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Necessary<\/h5><div class=\"cli_cookie_category_single_description\"><p>Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__cfduid<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by CloudFare. The cookie is used to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hssrc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Hubspot. According to their documentation, whenever HubSpot changes the session cookie, this cookie is also set to determine if the visitor has restarted their browser. If this cookie does not exist when HubSpot manages cookies, it is considered a new session.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-advertisement<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Advertisement\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-analytics<\/td><td class=\"cookielawinfo-column-4\">This cookies is set by GDPR Cookie Consent WordPress Plugin. The cookie is used to remember the user consent for the cookies under the category \"Analytics\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-necessary<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-non-necessary<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Non Necessary\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-performance<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to keep track of which cookies the user have approved for this site.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">JSESSIONID<\/td><td class=\"cookielawinfo-column-4\">Used by sites written in JSP. General purpose platform session cookies that are used to maintain users' state across page requests.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">viewed_cookie_policy<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Advertisement<\/h5><div class=\"cli_cookie_category_single_description\"><p>Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_fbp<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Facebook to deliver advertisement when they are on Facebook or a digital platform powered by Facebook advertising after visiting this website.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">bscookie<\/td><td class=\"cookielawinfo-column-4\">This cookie is a browser ID cookie set by Linked share Buttons and ad tags. <\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">fr<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by Facebook to show relevant advertisments to the users and measure and improve the advertisements. The cookie also tracks the behavior of the user across the web on sites that have Facebook pixel or Facebook social plugin.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">IDE<\/td><td class=\"cookielawinfo-column-4\">Used by Google DoubleClick and stores information about how the user uses the website and any other advertisement before visiting the website. This is used to present users with ads that are relevant to them according to the user profile.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">NID<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to a profile based on user's interest and display personalized ads to the users.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">VISITOR_INFO1_LIVE<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Youtube. Used to track the information of the embedded YouTube videos on a website.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Other<\/h5><div class=\"cli_cookie_category_single_description\"><p>Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-other<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">li_sugr<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lissc<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">u<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">ugid<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">UserMatchHistory<\/td><td class=\"cookielawinfo-column-4\">Linkedin - Used to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Performance<\/h5><div class=\"cli_cookie_category_single_description\"><p>Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">YSC<\/td><td class=\"cookielawinfo-column-4\">This cookies is set by Youtube and is used to track the views of embedded videos.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Analytics<\/h5><div class=\"cli_cookie_category_single_description\"><p>Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hstc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Hubspot and is used for tracking visitors. It contains the domain, utk, initial timestamp (first visit), last timestamp (last visit), current timestamp (this visit), and session number (increments for each subsequent session).<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_ga<\/td><td class=\"cookielawinfo-column-4\">This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_gat_gtag_UA_105904683_1<\/td><td class=\"cookielawinfo-column-4\">Google uses this cookie to distinguish users.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_gid<\/td><td class=\"cookielawinfo-column-4\">This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the wbsite is doing. The data collected including the number visitors, the source where they have come from, and the pages viisted in an anonymous form.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">GPS<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">hubspotutk<\/td><td class=\"cookielawinfo-column-4\">This cookie is used by HubSpot to keep track of the visitors to the website. This cookie is passed to Hubspot on form submission and used when deduplicating contacts.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><div class=\"cli_cookie_category_single\"><h5 class=\"cli_cookie_category_single_hd\">Functional<\/h5><div class=\"cli_cookie_category_single_description\"><p>Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.<\/p>\n<table class=\"wt-cli-element cookielawinfo-row-cat-table cookielawinfo-classic\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/tr><\/thead><tbody><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hssc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by HubSpot. The purpose of the cookie is to keep track of sessions. This is used to determine if HubSpot should increment the session number and timestamps in the __hstc cookie. It contains the domain, viewCount (increments each pageView in a session), and session start timestamp. <\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">bcookie<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by linkedIn. The purpose of the cookie is to enable LinkedIn functionalities on the page.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lang<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to store the language preferences of a user to serve up content in that stored language the next time user visit the website.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lidc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by LinkedIn and used for routing.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">messagesUtk<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by hubspot. This cookie is used to recognize the user who have chatted using the messages tool. This cookies is stored if the user leaves before they are added as a contact. If the returning user visits again with this cookie on the browser, the chat history with the user will be loaded.<\/td><\/tr><\/tbody><\/table>\n<\/div><\/div><\/div><\/p>\n<p><strong>The below list details the cookies used on our website.<\/strong><br \/>\n<table class=\"wt-cli-element cookielawinfo-classic cookielawinfo-row-cat-table\"><thead><tr><th scope=\"col\" class=\"cookielawinfo-column-1\">Cookie<\/th><th scope=\"col\" class=\"cookielawinfo-column-4\">Description<\/th><\/thead><tbody><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Necessary<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-advertisement<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Advertisement\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-performance<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to keep track of which cookies the user have approved for this site.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-analytics<\/td><td class=\"cookielawinfo-column-4\">This cookies is set by GDPR Cookie Consent WordPress Plugin. The cookie is used to remember the user consent for the cookies under the category \"Analytics\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hssrc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Hubspot. According to their documentation, whenever HubSpot changes the session cookie, this cookie is also set to determine if the visitor has restarted their browser. If this cookie does not exist when HubSpot manages cookies, it is considered a new session.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">JSESSIONID<\/td><td class=\"cookielawinfo-column-4\">Used by sites written in JSP. General purpose platform session cookies that are used to maintain users' state across page requests.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__cfduid<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by CloudFare. The cookie is used to identify individual clients behind a shared IP address and apply security settings on a per-client basis. It does not correspond to any user ID in the web application and does not store any personally identifiable information.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-necessary<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-non-necessary<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Non Necessary\".<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">viewed_cookie_policy<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.<\/td><\/tr><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Advertisement<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_fbp<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Facebook to deliver advertisement when they are on Facebook or a digital platform powered by Facebook advertising after visiting this website.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">fr<\/td><td class=\"cookielawinfo-column-4\">The cookie is set by Facebook to show relevant advertisments to the users and measure and improve the advertisements. The cookie also tracks the behavior of the user across the web on sites that have Facebook pixel or Facebook social plugin.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">bscookie<\/td><td class=\"cookielawinfo-column-4\">This cookie is a browser ID cookie set by Linked share Buttons and ad tags. <\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">NID<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to a profile based on user's interest and display personalized ads to the users.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">VISITOR_INFO1_LIVE<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Youtube. Used to track the information of the embedded YouTube videos on a website.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">IDE<\/td><td class=\"cookielawinfo-column-4\">Used by Google DoubleClick and stores information about how the user uses the website and any other advertisement before visiting the website. This is used to present users with ads that are relevant to them according to the user profile.<\/td><\/tr><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Other<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">cookielawinfo-checkbox-other<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">li_sugr<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">UserMatchHistory<\/td><td class=\"cookielawinfo-column-4\">Linkedin - Used to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lissc<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">u<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">ugid<\/td><td class=\"cookielawinfo-column-4\"><\/td><\/tr><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Performance<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">YSC<\/td><td class=\"cookielawinfo-column-4\">This cookies is set by Youtube and is used to track the views of embedded videos.<\/td><\/tr><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Analytics<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hstc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Hubspot and is used for tracking visitors. It contains the domain, utk, initial timestamp (first visit), last timestamp (last visit), current timestamp (this visit), and session number (increments for each subsequent session).<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">hubspotutk<\/td><td class=\"cookielawinfo-column-4\">This cookie is used by HubSpot to keep track of the visitors to the website. This cookie is passed to Hubspot on form submission and used when deduplicating contacts.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_ga<\/td><td class=\"cookielawinfo-column-4\">This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_gid<\/td><td class=\"cookielawinfo-column-4\">This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the wbsite is doing. The data collected including the number visitors, the source where they have come from, and the pages viisted in an anonymous form.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">_gat_gtag_UA_105904683_1<\/td><td class=\"cookielawinfo-column-4\">Google uses this cookie to distinguish users.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">GPS<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by Youtube and registers a unique ID for tracking users based on their geographical location<\/td><\/tr><tr class=\"cookielawinfo-row-cat-title\"><th colspan=\"2\" class=\"cookielawinfo-row-cat-title-head\">Functional<\/th><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">__hssc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by HubSpot. The purpose of the cookie is to keep track of sessions. This is used to determine if HubSpot should increment the session number and timestamps in the __hstc cookie. It contains the domain, viewCount (increments each pageView in a session), and session start timestamp. <\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lang<\/td><td class=\"cookielawinfo-column-4\">This cookie is used to store the language preferences of a user to serve up content in that stored language the next time user visit the website.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">lidc<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by LinkedIn and used for routing.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">bcookie<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by linkedIn. The purpose of the cookie is to enable LinkedIn functionalities on the page.<\/td><\/tr><tr class=\"cookielawinfo-row\"><td class=\"cookielawinfo-column-1\">messagesUtk<\/td><td class=\"cookielawinfo-column-4\">This cookie is set by hubspot. This cookie is used to recognize the user who have chatted using the messages tool. This cookies is stored if the user leaves before they are added as a contact. If the returning user visits again with this cookie on the browser, the chat history with the user will be loaded.<\/td><\/tr><\/tbody><\/table><\/p>\n<h4>How Long Do You Store My Cookies?<\/h4>\n<p>The information is stored for as long as they are needed to do the function they are intended to. The time can vary depending on what kind of information and the purpose of storing it.<span style=\"color: #ff0000;\"> <span style=\"color: #000000;\">Detailed information on the duration of specific cookies can be found under \"<a href=\"#what-types-of-cookies-do-we-use\">What Types of Cookies Do We Use<\/a>\".<\/span><\/span><\/p>\n<h4>How Can I Control The Cookie Preferences?<\/h4>\n<p>You can manage your cookies preferences by clicking on the \"Settings\" button and enabling or disabling the cookie categories on the popup according to your preferences.<\/p>\n<p>Should you decide to change your preferences later through your browsing session, you can click on the \"Privacy &amp; Cookie Policy\" tab on your screen. This will display the consent notice again enabling you to change your preferences or withdraw your consent entirely.<\/p>\n<p>In addition to this, different browsers provide different methods to block and delete cookies used by websites. You can change the settings of your browser to block\/delete the cookies. To find out more about how to manage and delete cookies, <a href=\"https:\/\/www.allaboutcookies.org\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">www.allaboutcookies.org<\/a>.<\/p>\n<h3><span class=\"ez-toc-section\" id=\"what-about-other-tracking-technologies,-like-web-beacons\"><\/span>What about other tracking technologies, like web beacons?<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>Cookies are not the only way to recognize or track visitors to a website. We may use other, similar technologies from time to time, like web beacons (sometimes called \"tracking pixels\" or \"clear gifs\"). These are tiny graphics files that contain a unique identifier that enable us to recognize when someone has visited our Websites or opened an e­mail that we have sent them. This allows us, for example, to monitor the traffic patterns of users from one page within our Websites to another, to deliver or communicate with cookies, to understand whether you have come to our Websites from an online advertisement displayed on a third-­party website, to improve site performance, and to measure the success of e­mail marketing campaigns. In many instances, these technologies are reliant on cookies to function properly, and so declining cookies will impair their functioning.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"do-you-serve-targeted-advertising\"><\/span>Do you serve targeted advertising?<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Third parties may serve cookies on your computer or mobile device to serve advertising through our Websites. These companies may use information about your visits to this and other websites in order to provide relevant advertisements about goods and services that you may be interested in. They may also employ technology that is used to measure the effectiveness of advertisements. This can be accomplished by them using cookies or web beacons to collect information about your visits to this and other sites in order to provide relevant advertisements about goods and services of potential interest to you. The information collected through this process does not enable us or them to identify your name, contact details or other details that directly identify you unless you choose to provide these.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"what-rights-you-have-over-your-data\"><\/span>What Rights You Have Over Your Data<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Users that have an account on this site, or have left comments, may exercise certain rights regarding their Data processed by Trigger Growth.<\/p>\n<p>In particular, Users have the right to do the following:<\/p>\n<ul>\n<li><strong>Withdraw their consent at any time.<\/strong> Users have the right to withdraw consent where they have previously given their consent to the processing of their Personal Data.<\/li>\n<li><strong>Object to processing of their data.<\/strong> Users have the right to object to the processing of their Data if the processing is carried out on a legal basis other than consent.<\/li>\n<li><strong>Access their Data.<\/strong> Users have the right to learn if Data is being processed by Trigger Growth, obtain disclosure regarding certain aspects of the processing, and obtain a copy of the Data undergoing processing.<\/li>\n<li><strong>Verify and seek rectification.<\/strong> Users have the right to verify the accuracy of their Data and ask for it to be updated or corrected.<\/li>\n<li><strong>Restrict the processing of their data.<\/strong> Users have the right, under certain circumstances, to restrict the processing of their data. In this case, Trigger Growth will not process their Data for any purpose other than storing it.<\/li>\n<li><strong>Have their Personal Data deleted or otherwise removed.<\/strong> Users have the right, under certain circumstances, to obtain the erasure of their Data from Trigger Growth. This does not include any data we are obliged to keep for administrative, legal, or security purposes.<\/li>\n<li><strong>Receive their Data and have it transferred to another controller.<\/strong> Users have the right to receive their Data in a structured, commonly used, and machine-readable format and, if technically feasible, to have it transmitted to another controller without any hindrance. This provision is applicable provided that the Data is processed by automated means and that the processing is based on the User's consent, on a contract which the User is part of or on pre-contractual obligations thereof.<\/li>\n<li><strong>Lodge a complaint.<\/strong> Users have the right to file a complaint to the Danish Data Protection Agency (<a href=\"https:\/\/www.datatilsynet.dk\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">datatilsynet.dk<\/a>) relating to our processing of their personal information.<\/li>\n<\/ul>\n<h3><span class=\"ez-toc-section\" id=\"how-to-exercise-these-rights\"><\/span>How to exercise these rights<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>Any requests to exercise User rights can be directed to Trigger Growth through the <a href=\"https:\/\/triggergrowth.com\/privacy-policy\/?preview=true#contact-information\">contact details<\/a> provided in this document.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"how-often-will-you-update-this-privacy-policy\"><\/span>How often will you update this Privacy Policy?<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>We may update this Privacy Policy from time to time in order to reflect, for example, changes to the cookies we use or for other operational, legal or regulatory reasons.<\/p>\n<p>Please, therefore, re­visit this Privacy Policy regularly to stay informed about our use of cookies and related technologies.<\/p>\n<p>The date at the top of this Privacy Policy indicates when it was last updated.<\/p>\n<h2><span class=\"ez-toc-section\" id=\"where-can-i-get-further-information\"><\/span>Where can I get further information?<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>If you have any questions about our use of cookies or other technologies, please email us at <a href=\"mailto:hello@triggergrowth.com\">hello@triggergrowth.com<\/a> or by post to:<\/p>\n<h2><span class=\"ez-toc-section\" id=\"contact-information\"><\/span>Contact information<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Kim Døfler Sand Laursen<\/p>\n<p>Trigger Growth<br \/>\nItaliensvej 12 3TV.<br \/>\n2300, København S<br \/>\nPhone: +45 26801162<br \/>\nEmail: <a href=\"mailto:hello@triggergrowth.com\">hello@triggergrowth.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Privacy Policy explains how Trigger Growth ApS (\"Trigger Growth\", \"we\", \"us\", and\"ours\") handle personal data and use cookies and similar technologies to recognize you (\"visitor\", \"user\") when you visit our websites at https:\/\/triggergrowth.com (\"Websites\"). It explains what these technologies are and why we use them, as well as your rights to control our use [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":50,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - Trigger Growth<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/triggergrowth.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - Trigger Growth\" \/>\n<meta property=\"og:description\" content=\"The Privacy Policy explains how Trigger Growth ApS (&quot;Trigger Growth&quot;, &quot;we&quot;, &quot;us&quot;, and&quot;ours&quot;) handle personal data and use cookies and similar technologies to recognize you (&quot;visitor&quot;, &quot;user&quot;) when you visit our websites at https:\/\/triggergrowth.com (&quot;Websites&quot;). It explains what these technologies are and why we use them, as well as your rights to control our use [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/triggergrowth.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"Trigger Growth\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-07T16:36:31+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/triggergrowth.com\/#website\",\"url\":\"https:\/\/triggergrowth.com\/\",\"name\":\"Trigger Growth\",\"description\":\"We make websites that create results\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/triggergrowth.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/triggergrowth.com\/privacy-policy\/#webpage\",\"url\":\"https:\/\/triggergrowth.com\/privacy-policy\/\",\"name\":\"Privacy Policy - Trigger Growth\",\"isPartOf\":{\"@id\":\"https:\/\/triggergrowth.com\/#website\"},\"datePublished\":\"2020-03-12T09:52:51+00:00\",\"dateModified\":\"2020-06-07T16:36:31+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/triggergrowth.com\/privacy-policy\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":5,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":583,"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/pages\/3\/revisions\/583"}],"wp:attachment":[{"href":"https:\/\/triggergrowth.com\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}